DataProcessors/СамообслуживаниеПартнеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СамообслуживаниеПартнеров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/СпособыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпособыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаПоАдресу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КПолучателюОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоручениеЭкспедиторуНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоручениеЭкспедиторуСоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоручениеЭкспедиторуВПункте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаДоПунктаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПоставщикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НашимиСиламиСАдресаОтправителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтОтправителяОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РСК_ПеревозчикДоПВЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РСК_ПеревозчикДоКлиента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/СамообслуживаниеПартнеров/Forms/МастерОформленияЗаказа/Ext/Form/Module.bsl
&НаСервере
&ИзменениеИКонтроль("ЗаполнитьСтруктуруПоРеквизитамФормы")
Функция РСК_ЗаполнитьСтруктуруПоРеквизитамФормы()

	СтруктураДляРасчетаСкидок = Новый Структура;

	СтруктураДляРасчетаСкидок.Вставить("Ссылка",Документы.ЗаказКлиента.ПустаяСсылка());
	СтруктураДляРасчетаСкидок.Вставить("Дата",ТекущаяДатаСеанса());
	СтруктураДляРасчетаСкидок.Вставить("Соглашение",Соглашение);
	СтруктураДляРасчетаСкидок.Вставить("Склад",Склад);
	СтруктураДляРасчетаСкидок.Вставить("КартаЛояльности",Справочники.КартыЛояльности.ПустаяСсылка());
	СтруктураДляРасчетаСкидок.Вставить("Партнер",Партнер);
	СтруктураДляРасчетаСкидок.Вставить("ГрафикОплаты",ГрафикОплаты);
	СтруктураДляРасчетаСкидок.Вставить("ФормаОплаты",ФормаОплаты);
	СтруктураДляРасчетаСкидок.Вставить("Валюта",Валюта);
	СтруктураДляРасчетаСкидок.Вставить("Контрагент",Контрагент);
	СтруктураДляРасчетаСкидок.Вставить("КонтактноеЛицо", КонтактноеЛицо);
	СтруктураДляРасчетаСкидок.Вставить("Менеджер",Неопределено);
	СтруктураДляРасчетаСкидок.Вставить("Организация",Организация);
	СтруктураДляРасчетаСкидок.Вставить("НалогообложениеНДС",НалогообложениеНДС);
	СтруктураДляРасчетаСкидок.Вставить("ЦенаВключаетНДС",ЦенаВключаетНДС);
	СтруктураДляРасчетаСкидок.Вставить("СуммаДокумента",СуммаДокумента);
	СтруктураДляРасчетаСкидок.Вставить("СкидкиРассчитаны",Ложь);
	СтруктураДляРасчетаСкидок.Вставить("ДатаОтгрузки",ДатаОтгрузки);
	СтруктураДляРасчетаСкидок.Вставить("ДатаОтгрузки",ДатаОтгрузки);
	СтруктураДляРасчетаСкидок.Вставить("ДополнительнаяИнформация",ДополнительнаяИнформация);
	СтруктураДляРасчетаСкидок.Вставить("ХозяйственнаяОперация",ХозяйственнаяОперация);
	СтруктураДляРасчетаСкидок.Вставить("ВремяДоставкиС",ВремяДоставкиС);
	СтруктураДляРасчетаСкидок.Вставить("ВремяДоставкиПо",ВремяДоставкиПо);
	СтруктураДляРасчетаСкидок.Вставить("ДополнительнаяИнформацияПоДоставке",ДополнительнаяИнформацияПоДоставке);
	СтруктураДляРасчетаСкидок.Вставить("ЗонаДоставки",ЗонаДоставки);
	СтруктураДляРасчетаСкидок.Вставить("АдресДоставкиЗначенияПолей",АдресДоставкиЗначенияПолей);
	СтруктураДляРасчетаСкидок.Вставить("ПеревозчикПартнер",ПеревозчикПартнер);
	СтруктураДляРасчетаСкидок.Вставить("АдресДоставки",АдресДоставки);
	СтруктураДляРасчетаСкидок.Вставить("АдресДоставкиПеревозчика",АдресДоставкиПеревозчика);
	СтруктураДляРасчетаСкидок.Вставить("АдресДоставкиПеревозчикаЗначенияПолей",АдресДоставкиПеревозчикаЗначенияПолей);
	СтруктураДляРасчетаСкидок.Вставить("ВернутьМногооборотнуюТару", ВернутьМногооборотнуюТару);
	СтруктураДляРасчетаСкидок.Вставить("СрокВозвратаМногооборотнойТары", СрокВозвратаМногооборотнойТары);
	СтруктураДляРасчетаСкидок.Вставить("ТребуетсяЗалогЗаТару", ТребуетсяЗалогЗаТару);

	СтруктураДляРасчетаСкидок.Вставить("НеОтгружатьЧастями",НеОтгружатьЧастями);
	Если ИспользуютсяДоговорыКонтрагентов Тогда
		СтруктураДляРасчетаСкидок.Вставить("Договор",Договор);
	КонецЕсли;

	СтруктураДляРасчетаСкидок.Вставить("Товары",ОтобранныеТоварыРассчитанныеСкидки);
	СтруктураДляРасчетаСкидок.Вставить("СкидкиНаценки",СкидкиНаценки);
	СтруктураДляРасчетаСкидок.Вставить("ЭтапыГрафикаОплаты",ЭтапыГрафикаОплаты);
	СтруктураДляРасчетаСкидок.Вставить("ОбъектАвторизации", ОбъектАвторизации);
	СтруктураДляРасчетаСкидок.Вставить("Приоритет", Приоритет);
	
	#Удаление
	Если СпособДоставки	= ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчика")
		#КонецУдаления
		#Вставка
	//++ РС Консалт: Минаков А.С. Задача 22756
		Если (СпособДоставки	= ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчика")
			Или СпособДоставки	= ПредопределенноеЗначение("Перечисление.СпособыДоставки.РСК_ПеревозчикДоКлиента")
			Или СпособДоставки	= ПредопределенноеЗначение("Перечисление.СпособыДоставки.РСК_ПеревозчикДоПВЗ"))
		#КонецВставки
		И СпособДоставкиОбъект = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу") Тогда
		СтруктураДляРасчетаСкидок.Вставить("СпособДоставки"		,СпособДоставкиОбъект);
		СтруктураДляРасчетаСкидок.Вставить("СпособДоставкиОбект",СпособДоставкиОбъект);
	Иначе
		СтруктураДляРасчетаСкидок.Вставить("СпособДоставки",СпособДоставки);
	КонецЕсли;

	Возврат СтруктураДляРасчетаСкидок;

КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("НеВыполненыУсловияПереходаПоСтраницам")
Функция РСК_НеВыполненыУсловияПереходаПоСтраницам(Команда)

	Отказ = Ложь;
	ОчиститьСообщения();

	Если Элементы.СтраницыОсновные.ТекущаяСтраница = Элементы.СтраницаДополнительныеРеквизиты Тогда
		Если Команда.Имя = "Далее" Тогда

			Если НЕ ЗначениеЗаполнено(ФормаОплаты) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Не указана форма оплаты.';
				|en = 'Payment method is not specified.'"),,"ФормаОплаты");
				Отказ = Истина;
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Не указан контрагент.';
				|en = 'Counterparty is not specified.'"),,"Контрагент");
				Отказ = Истина;
			КонецЕсли;

			Если ИспользуютсяДоговорыКонтрагентов И НЕ ЗначениеЗаполнено(Договор) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Не указан договор.';
				|en = 'Contract is not specified.'"),,"Договор");
				Отказ = Истина;
			КонецЕсли;

			Если Не ЗначениеЗаполнено(СпособДоставки)
				Или СпособДоставки =  ПредопределенноеЗначение("Перечисление.СпособыДоставки.Самовывоз") Тогда
				// Нет обязательных полей;
			ИначеЕсли (СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.ДоКлиента")
				Или СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки"))
				И Не ЗначениеЗаполнено(АдресДоставки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Не заполнен адрес доставки.';
				|en = 'Delivery address is not filled in.'"),,"АдресДоставки");
				Отказ = Истина;
				#Удаление
			ИначеЕсли СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчика") Тогда
				#КонецУдаления
				#Вставка
	//++ РС Консалт: Минаков А.С. Задача 22756
			ИначеЕсли СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчика") 
				Или СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.РСК_ПеревозчикДоКлиента")
				Или СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.РСК_ПеревозчикДоПВЗ") Тогда
				#КонецВставки
				Если Не ЗначениеЗаполнено(АдресДоставки) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Не заполнен адрес доставки.';
					|en = 'Delivery address is not filled in.'"),,"АдресДоставки");
					Отказ = Истина;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(ПеревозчикПартнер) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Не выбран перевозчик.';
					|en = 'Carrier is not selected.'"),,"ПеревозчикПартнер");
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

	ИначеЕсли Элементы.СтраницыОсновные.ТекущаяСтраница = Элементы.СтраницаТовары Тогда	 

		Если ОтобранныеТоварыРассчитанныеСкидки.Количество() = 0 Тогда

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Нет товаров для оформления заказа.';
			|en = 'No goods for order registration.'")
			,,"ОтобранныеТоварыРассчитанныеСкидки");
			Отказ = Истина;

		КонецЕсли;

	КонецЕсли;

	Возврат Отказ;

КонецФункции
